Revit 2026 API

# PlasticvinylPatternType Enumeration

---

The enumerated type representing the permitted values for the asset property "PlasticvinylPattern" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlasticvinylPatternType
```
```vb
Public Enumeration PlasticvinylPatternType
```
```cpp
public enum class PlasticvinylPatternType
```
```fsharp
type PlasticvinylPatternType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace